{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"configuration.textile.editor.drop.enabled": "Enable/disable dropping into the textile editor to insert shift. Requires enabling `#workbench.experimental.editor.dropIntoEditor.enabled#`.",
	"configuration.textile.editor.pasteLinks.enabled": "Al habilitar o deshabilitar el pegado de archivos en un editor de Textile, se insertarán vínculos de Textile.",
	"configuration.textile.experimental.validate.enabled.description": "Habilite o deshabilite todos los informes de errores en los archivos Textile.",
	"configuration.textile.experimental.validate.fileLinks.enabled.description": "Valide los vínculos a otros archivos de Textile, por ejemplo, '\"link\":/path/to/file.textile'. Esto comprueba que los archivos de destino existen. Requiere habilitar '#textile.experimental.validate.enabled#'.",
	"configuration.textile.experimental.validate.headerLinks.enabled.description": "Valide los vínculos a encabezados en archivos Textile, por ejemplo, '\"link\":#header'. Requiere habilitar '#textile.experimental.validate.enabled#'.",
	"configuration.textile.experimental.validate.ignoreLinks.description": "Configure vínculos que no deben validarse. Por ejemplo, `/about` no validaría el vínculo `\"about\":/about`, mientras que el valor global `/assets/**/*.svg` le permitirá omitir la validación de cualquier vínculo a archivos `.svg` en el directorio `assets`.",
	"configuration.textile.experimental.validate.referenceLinks.enabled.description": "Validar vínculos de referencia en archivos Textile, por ejemplo, '\"link\":ref'.  Requiere habilitar '#textile.experimental.validate.enabled#'.",
	"configuration.textile.links.openLocation.beside": "Abrir enlaces junto al editor activo.",
	"configuration.textile.links.openLocation.currentGroup": "Abra vínculos en el grupo de editor activo.",
	"configuration.textile.links.openLocation.description": "Controla dónde se deben abrir los vínculos de los archivos Textile.",
	"configuration.textile.preview.openTextileLinks.description": "Controla cómo deben abrirse los vínculos hacia otros archivos Textile en la vista previa de Textile.",
	"configuration.textile.preview.openTextileLinks.inEditor": "Intenta abrir los vínculos en el editor.",
	"configuration.textile.preview.openTextileLinks.inPreview": "Intenta abrir los vínculos en la vista previa de Textile.",
	"configuration.textile.suggest.paths.enabled.description": "Habilitar o deshabilitar sugerencias de ruta de acceso para vínculos de marcado",
	"description": "Proporciona un potente soporte de lenguaje para archivos Textile.",
	"displayName": "Características del lenguaje Textile",
	"textile.findAllFileReferences": "Buscar referencias de archivo",
	"textile.preview.breaks.desc": "Establece cómo se representan los saltos de línea en la vista previa de Textile. Si se establece en \"true\", se crea <br> para las líneas nuevas dentro de los párrafos.",
	"textile.preview.doubleClickToSwitchToEditor.desc": "Haga doble clic en la vista previa de Textile para cambiar al editor.",
	"textile.preview.fontFamily.desc": "Controla la familia de fuentes que se usa en la vista previa de Textile.",
	"textile.preview.fontSize.desc": "Controla el tamaño de fuente en píxeles que se usa en la vista previa de Textile.",
	"textile.preview.lineHeight.desc": "Controla la altura de línea que se usa en la vista previa de Textile. Este número es relativo al tamaño de fuente.",
	"textile.preview.linkify": "Habilita o deshabilita la conversión de texto de tipo URL a vínculos en la vista previa de Textile.",
	"textile.preview.markEditorSelection.desc": "Marca la selección del editor actual en la vista previa de Textile.",
	"textile.preview.refresh.title": "Actualizar vista previa",
	"textile.preview.scrollEditorWithPreview.desc": "Al desplazarse en la vista previa de Textile, se actualiza la vista del editor.",
	"textile.preview.scrollPreviewWithEditor.desc": "Al desplazarse en el editor de Textile, se actualiza la vista de la previsualización.",
	"textile.preview.title": "Abrir vista previa",
	"textile.preview.toggleLock.title": "Cambiar fijación de la vista previa ",
	"textile.preview.typographer": "Habilita o deshabilita algunos embellecimientos de comillas y reemplazos independientes del idioma en la vista previa de Textile.",
	"textile.previewSide.title": "Abrir vista previa en el lateral",
	"textile.showLockedPreviewToSide.title": "Abrir vista previa fija en el lateral",
	"textile.showPreviewSecuritySelector.title": "Cambiar configuración de seguridad de vista previa",
	"textile.showSource.title": "Mostrar origen",
	"textile.styles.dec": "Lista de direcciones URL o rutas de acceso locales a hojas de estilo CSS que se van a usar desde la vista previa de Textile. Las rutas de acceso relativas se interpretan en relación con la carpeta abierta en el Explorador. Si no hay ninguna carpeta abierta, se interpretan en relación con la ubicación del archivo Textile. Todo \"\\\" debe escribirse como \"\\\\\".",
	"textile.trace.desc": "Habilita el registro de depuración para las extensiones de Textile. ",
	"workspaceTrust": "Necesario para cargar los estilos configurados en el área de trabajo."
}