{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"displayName": "Fonctionnalités de langage Textile",
	"description": "Fournit une prise en charge riche de langage pour Textile",
	"textile.preview.breaks.desc": "Définit la façon dont les sauts de ligne sont affichés dans l'aperçu Textile. Si vous affectez la valeur 'true', un <br> est créé pour les nouvelles lignes à l'intérieur des paragraphes.",
	"textile.preview.linkify": "Activez ou désactivez la conversion de texte de type URL en liens dans l’aperçu Textile.",
	"textile.preview.doubleClickToSwitchToEditor.desc": "Double-cliquez dans l'aperçu Textile pour passer à l'éditeur.",
	"textile.preview.fontFamily.desc": "Contrôle la famille de polices utilisée dans l'aperçu Textile.",
	"textile.preview.fontSize.desc": "Contrôle la taille de police en pixels utilisée dans l'aperçu Textile.",
	"textile.preview.lineHeight.desc": "Contrôle la hauteur de ligne utilisée dans l'aperçu Textile. Ce nombre est relatif à la taille de police.",
	"textile.preview.markEditorSelection.desc": "Permet de marquer la sélection actuelle de l'éditeur dans l'aperçu Textile.",
	"textile.preview.scrollEditorWithPreview.desc": "Lors du défilement de l'aperçu textile, actualiser l’affichage de l’éditeur.",
	"textile.preview.scrollPreviewWithEditor.desc": "Lors du défilement d’un éditeur textile, actualiser l’affichage de l’aperçu.",
	"textile.preview.title": "Ouvrir l'aperçu",
	"textile.previewSide.title": "Ouvrir l'aperçu sur le côté",
	"textile.showLockedPreviewToSide.title": "Ouvrir l'aperçu verrrouillé sur le côté",
	"textile.showSource.title": "Afficher la source",
	"textile.styles.dec": "Liste d'URL ou de chemins locaux de feuilles de style CSS à utiliser dans l'aperçu Textile. Les chemins relatifs sont interprétés par rapport au dossier ouvert dans l'explorateur. S'il n'y a aucun dossier ouvert, ils sont interprétés par rapport à l'emplacement du fichier Textile. Tous les signes '\\' doivent être écrits sous la forme '\\\\'.",
	"textile.showPreviewSecuritySelector.title": "Changer les paramètres de sécurité de l'aperçu",
	"textile.trace.desc": "Active la journalisation du débogage pour l'extension Textile.",
	"textile.preview.refresh.title": "Actualiser l'aperçu",
	"textile.preview.toggleLock.title": "Activer/désactiver le verrouillage de l'aperçu",
	"configuration.textile.preview.openTextileLinks.description": "Contrôle la façon dont les liens vers d'autres fichiers Textile doivent être ouverts dans l'aperçu Textile.",
	"configuration.textile.preview.openTextileLinks.inEditor": "Essayer d’ouvrir les liens dans l’éditeur",
	"configuration.textile.preview.openTextileLinks.inPreview": "Essayer d'ouvrir les liens dans l'aperçu textile",
	"configuration.textile.links.openLocation.description": "Contrôle où ouvrir les liens dans les fichiers Textile.",
	"configuration.textile.links.openLocation.currentGroup": "Ouvrez les liens dans le groupe d'éditeurs actif.",
	"configuration.textile.links.openLocation.beside": "Ouvrez les liens à côté de l'éditeur actif."
}
