{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"configuration.textile.links.openLocation.beside": "Ouvrez les liens à côté de l'éditeur actif.",
	"configuration.textile.links.openLocation.currentGroup": "Ouvrez les liens dans le groupe d'éditeurs actif.",
	"configuration.textile.links.openLocation.description": "Contrôle l'emplacement où doivent s'ouvrir les liens dans les fichiers Textile.",
	"configuration.textile.preview.openTextileLinks.description": "Contrôle la façon dont les liens vers d'autres fichiers Textile doivent s'ouvrir dans l'aperçu Textile.",
	"configuration.textile.preview.openTextileLinks.inEditor": "Tente d'ouvrir les liens dans l'éditeur.",
	"configuration.textile.preview.openTextileLinks.inPreview": "Tente d'ouvrir les liens dans l'aperçu Textile.",
	"description": "Fournit une prise en charge riche de langage pour Textile",
	"displayName": "Fonctionnalités de langage Textile",
	"textile.preview.breaks.desc": "Définit la façon dont les sauts de ligne sont affichés dans l'aperçu Textile. Si vous affectez la valeur 'true', un <br> est créé pour les nouvelles lignes à l'intérieur des paragraphes.",
	"textile.preview.doubleClickToSwitchToEditor.desc": "Double-cliquez dans l'aperçu Textile pour passer à l'éditeur.",
	"textile.preview.fontFamily.desc": "Contrôle la famille de polices utilisée dans l'aperçu Textile.",
	"textile.preview.fontSize.desc": "Contrôle la taille de police en pixels utilisée dans l'aperçu Textile.",
	"textile.preview.lineHeight.desc": "Contrôle la hauteur de ligne utilisée dans l'aperçu Textile. Ce nombre est relatif à la taille de police.",
	"textile.preview.linkify": "Active ou désactive la conversion de texte de type URL en liens dans l'aperçu Textile.",
	"textile.preview.markEditorSelection.desc": "Marque la sélection actuelle de l'éditeur dans l'aperçu Textile.",
	"textile.preview.refresh.title": "Actualiser l'aperçu",
	"textile.preview.scrollEditorWithPreview.desc": "Quand un aperçu Textile défile, la vue de l'éditeur est mise à jour.",
	"textile.preview.scrollPreviewWithEditor.desc": "Quand la fenêtre de l'éditeur Textile défile, la vue de l'aperçu est mise à jour.",
	"textile.preview.title": "Ouvrir l'aperçu",
	"textile.preview.toggleLock.title": "Activer/désactiver le verrouillage de l'aperçu",
	"textile.preview.typographer": "Active ou désactive certains remplacements indépendants du langage ainsi que l'amélioration de la présentation des guillemets dans l'aperçu Textile.",
	"textile.previewSide.title": "Ouvrir l'aperçu sur le côté",
	"textile.showLockedPreviewToSide.title": "Ouvrir l'aperçu verrrouillé sur le côté",
	"textile.showPreviewSecuritySelector.title": "Changer les paramètres de sécurité de l'aperçu",
	"textile.showSource.title": "Afficher la source",
	"textile.styles.dec": "Liste d'URL ou de chemins locaux de feuilles de style CSS à utiliser dans l'aperçu Textile. Les chemins relatifs sont interprétés par rapport au dossier ouvert dans l'Explorateur. Si aucun dossier n'est ouvert, ils sont interprétés par rapport à l'emplacement du fichier Textile. Tous les signes '\\' doivent être écrits sous la forme '\\\\'.",
	"textile.trace.desc": "Active la journalisation du débogage pour l'extension Textile.",
	"workspaceTrust": "Requis pour le chargement des styles configurés dans l’espace de travail."
}